<?php
// Объявляем переменную с целочисленным значением
$integerVar = 42;
echo $integerVar;

// Печатаем перенос строки
echo "\n";

// Объявляем переменную с числом с плавающей запятой
$floatVar = 3.14;
echo $floatVar;

// Печатаем перенос строки
echo "\n";

// Выводим число 12 с использованием математических операций
echo (10 + 2);

// Печатаем перенос строки
echo "\n";

// Объявляем переменные для расходов
$lastMonth = 200;
$thisMonth = 150;

// Выводим разницу расходов
echo "I spent " . ($lastMonth - $thisMonth) . " more last month.";
